{
    "law_title": "Republic Act No. 9514",
    "short_title": "Revised Fire Code of the Philippines of 2008",
    "date_approved": "December 19, 2008",
    "repeals": "Presidential Decree No. 1185",
    "sections": [
        {
            "section": 1,
            "title": "Short Title",
            "content": "This Act shall be known as the 'Revised Fire Code of the Philippines of 2008'."
        },
        {
            "section": 2,
            "title": "Declaration of Policy",
            "content": "It is the policy of the State to ensure public safety and promote economic development through the prevention and suppression of all kinds of destructive fires and promote the professionalization of the fire service as a profession."
        },
        {
            "section": 3,
            "title": "Definition of Terms",
            "content": "Contains official definitions such as Abatement, Administrator, Fire, Fire Hazard, Fire Safety Construction, Sprinkler System, Standpipe System, Occupancy, Owner, and other technical fire-related terms as provided in the Act."
        },
        {
            "section": 4,
            "title": "Applicability of the Code",
            "content": "The provisions of the Fire Code shall apply to all persons and all private and public buildings, facilities or structures erected or constructed before and after its effectivity."
        },
        {
            "section": 5,
            "title": "Responsibility for Enforcement",
            "content": "The Code shall be administered and enforced by the Bureau of Fire Protection (BFP) under the supervision of the Chief, BFP, with authority to issue IRR, conduct inspections, issue FSIC, stop work orders, and enforce compliance."
        },
        {
            "section": 6,
            "title": "Technical Staff",
            "content": "The Chief, BFP shall constitute a technical staff knowledgeable in fire prevention, safety and suppression to study, review and recommend improvements and amendments."
        },
        {
            "section": 7,
            "title": "Inspections and Safety Measures",
            "content": "Requires fire safety inspections, safety measures for hazardous materials and operations, and provision of fire safety construction and protective systems such as sprinklers, fire alarms, fire exits, and emergency lighting."
        },
        {
            "section": 8,
            "title": "Prohibited Acts",
            "content": "Lists prohibited acts including blocking exits, obstructing fire lanes, locking fire exits, tampering with fire equipment, giving false alarms, overcrowding public assembly buildings, and electrical overloading."
        },
        {
            "section": 9,
            "title": "Violation, Penalties and Abatement",
            "content": "Fire hazards must be abated immediately. BFP may issue notice to comply, declare building as FIRE HAZARD or FIRETRAP, order closure, and conduct summary abatement."
        },
        {
            "section": 10,
            "title": "Enforcement of Lien",
            "content": "Government expenses for summary abatement become lien on property and may result in public auction if unpaid."
        },
        {
            "section": 11,
            "title": "Penalties",
            "content": "Administrative fines up to P50,000; criminal penalties including imprisonment and fines up to P100,000; penalties for public officers for negligence or corruption in enforcement."
        },
        {
            "section": 12,
            "title": "Appropriation and Sources of Income",
            "content": "Provides funding sources including fire code fees, insurance premium percentage, equipment sales percentage, and assessed value percentage of buildings."
        },
        {
            "section": 13,
            "title": "Collection and Use of Fees",
            "content": "BFP collects taxes and fees; 20% retained by LGU for fire station use; 80% remitted to National Treasury for BFP modernization."
        },
        {
            "section": 14,
            "title": "Implementing Rules and Regulations",
            "content": "DILG shall issue implementing rules within 60 days from effectivity."
        },
        {
            "section": 15,
            "title": "Repealing Clause",
            "content": "Presidential Decree No. 1185 is repealed."
        },
        {
            "section": 16,
            "title": "Separability Clause",
            "content": "If any provision is declared unconstitutional, other provisions remain valid."
        },
        {
            "section": 17,
            "title": "Effectivity",
            "content": "This Act shall take effect fifteen (15) days after publication in the Official Gazette or in two national newspapers of general circulation."
        }
    ]
}