{
  "law_title": "Republic Act No. 9514",
  "short_title": "Revised Fire Code of the Philippines of 2008",
  "date_approved": "December 19, 2008",
  "repeals": "Presidential Decree No. 1185",
  "full_text": "Fourteenth Congress\n\nSecond Regular Session\n\nBegun and held in Metro Manila, on Monday, the twenty-eight day of July, two thousand eight.\n\nREPUBLIC ACT No. 9514             December 19, 2008\nRepealed PD 1185\n\nAN ACT ESTABLISHING A COMPREHENSIVE FIRE CODE OF THE PHILIPPINES, REPEALING PRESIDENTIAL DECREE NO. 1185 AND FOR OTHER PURPOSES\n\nBe it enacted by the Senate and House of Representatives of the Philippines in Congress assembled:\n\nSection 1. This Act shall be known as the \"Revised Fire Code of the Philippines of 2008\".\n\nSection 2. It is the policy of the State to ensure public safety and promote economic development through the prevention and suppression of all kinds of destructive fires and promote the professionalization of the fire service as a profession. Towards this end, the State shall enforce all laws, rules and regulations to ensure adherence to standard fire prevention and safety measures, and promote accountability for fire safety in the fire protection service and prevention service.\n\nSection 3. Definition of Terms. - As used in this Fire Code, the following words and phrases shall mean and be construed as indicated:\n\nAbatement - Any act that would remove or neutralize a fire hazard.\n\nAdministrator - Any person who acts as agent of the owner and manages the use of a building for him.\n\nBlasting Agent - Any material or mixture consisting of a fuel and oxidizer used to set off explosives.\n\nCellulose Nitrate Or Nitro Cellulose - A highly combustible and explosive compound produced by the reaction of nitric acid with a cellulose material.\n\nCellulose Nitrate Plastic (Pyroxylin) - Any plastic substance, materials or compound having cellulose nitrate (nitro cellulose) as base.\n\nCombustible, Flammable or Inflammable - Descriptive of materials that are easily set on fire.\n\nCombustible Fiber - Any readily ignitable and free burning fiber such as cotton, oakum, rags, waste cloth, waste paper, kapok, hay, straw, Spanish moss, excelsior and other similar materials commonly used in commerce.\n\nCombustible Liquid - Any liquid having a flash point at or above 37.8_C (100_F).\n\nCorrosive Liquid - Any liquid which causes fire when in contact with organic matter or with certain chemicals.\n\nCurtain Board - A vertical panel of non-combustible or fire resistive materials attached to and extending below the bottom chord of the roof trusses, to divide the underside of the roof into separate compartments so that heat and smoke will be directed upwards to a roof vent.\n\nCryogenic - Descriptive of any material which by its nature or as a result of its reaction with other elements produces a rapid drop in temperature of the immediate surroundings.\n\nDamper - A normally open device installed inside an air duct system which automatically closes to restrict the passage of smoke or fire.\n\nDistillation - The process of first raising the temperature in separate the more volatile from the less volatile parts and then cooling and condensing the resulting vapor so as to produce a nearly purified substance.\n\nDuct System - A continuous passageway for the transmission of air.\n\nDust - A finely powdered substance which, when mixed with air in the proper proportion and ignited will cause an explosion.\n\nElectrical Arc - An extremely hot luminous bridge formed by passage of an electric current across a space between two conductors or terminals due to the incandescence of the conducting vapor.\n\nEmber - A hot piece or lump that remains after a material has partially burned, and is still oxidizing without the manifestation of flames.\n\nFinishes - Materials used as final coating of a surface for ornamental or protective purposes.\n\nFire - The active principle of burning, characterized by the heat and light of combustion.\n\nFire Trap - A building unsafe in case of fire because it will burn easily or because it lacks adequate exits or fire escapes.\n\nFire Alarm - Any visual or audible signal produced by a device or system to warm the occupants of the building or fire fighting elements of the presence or danger of fire to enable them to undertake immediate action to save life and property and to suppress the fire.\n\nFire Door - A fire resistive door prescribed for openings in fire separation walls or partitions.\n\nFire Hazard - Any condition or act which increases or may cause an increase in the probability of the occurrence of fire, or which may obstruct, delay, hinder or interfere with fire fighting operations and the safeguarding of life and property.\n\nFire Lane - The portion of a roadway or publicway that should be kept opened and unobstructed at all times for the expedient operation of fire fighting units.\n\nFire Protective And Fire Safety Device - Any device intended for the protection of buildings or persons to include but not limited to built-in protection system such as sprinklers and other automatic extinguishing system, detectors for heat, smoke and combustion products and other warning system components, personal protective equipment such as fire blankets, helmets, fire suits, gloves and other garments that may be put on or worn by persons to protect themselves during fire.\n\nFire Safety Constructions - Refers to design and installation of walls, barriers, doors, windows, vents, means of egress, etc. integral to and incorporated into a building or structure in order to minimize danger to life from fire, smoke, fumes or panic before the building is evacuated. These features are also designed to achieve, among others, safe and rapid evacuation of people through means of egress sealed from smoke or fire, the confinement of fire or smoke in the room or floor of origin and delay their spread to other parts of the building by means of smoke sealed and fire resistant doors, walls and floors. It shall also mean to include the treatment of buildings components or contents with flame retardant chemicals.\n\nSection 4. Applicability of The Code. - The provisions of the Fire Code shall apply to all persons and all private and public buildings, facilities or structures erected or constructed before and after its effectivity.\n\nSection 5. Responsibility for the Enforcement of this Code. - This Code shall be administered and enforced by the Bureau of Fire Protection (BFP)...\n\nSection 6. Technical Staff. - The Chief, BFP shall constitute a technical staff...\n\nSection 7. Inspections, Safety Measures, Fire Safety, Constructions, and Protective and/or Warning Systems...\n\nSection 8. Prohibited Acts...\n\nSection 9. Violation, Penalties and Abatement of Fire Hazard...\n\nSection 10. Enforcement of The Lien...\n\nSection 11. Penalties...\n\nSection 12. Appropriation and Sources of Income...\n\nSection 13. Collection of Taxes, Fees and Fines...\n\nSection 14. Within sixty (60) days from the effectivity of this Act, the Secretary of the Interior and Local Government shall issue the rules and regulations for its effective implementation.\n\nSection 15. Presidential Decree No 1185 is hereby repealed.\n\nSection 16. In case any provision of this Act or any portion thereof is declared unconstitutional by a competent court, other provisions shall not be affected thereby.\n\nSection 17. This Act shall take effect fifteen (15) days after its publication in the Official Gazette or in two (2) national newspapers of general circulation.\n\nApproved\n\n(Sgd.) PROSPERO C. NOGRALES\nSpeaker of the House of Representative\n\n(Sgd.) MANNY VILLAR\nPresident of the Senate\n\n(Sgd.) MARILYN B. BARUA-YAP\nSecretary General\nHouse of Representative\n\n(Sgd.) EMMA LIRIO-REYES\nSecretary of the Senate\n\nApproved: DEC 19, 2008\n\n(Sgd.) GLORIA MACAPAGAL-ARROYO\nPresident of the Philippines\n"
}